app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "posts" SET "title" = ?, "text" = ?, "updated_at" = ? WHERE "posts"."id" = 1  [["title", "123123123"], ["text", "123123123"], ["updated_at", Thu, 25 Jul 2013 14:36:52 UTC +00:00]]
---
  def update
    @post = Post.find(params[:id])

    if @post.update(params[:post].permit(:title, :text))